const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21

test('20 + 1 เท่ากับ 21', ()=>
{
  expect(sum(20,1)).toBe(21)
});


// 2 + 5 เท่ากับ ?

test('2 + 5 เท่ากับ 7', ()=> 
{
  expect(sum(2,5)).toBe(7)
}); 


// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

//1
test('99 + 99 เท่ากับ ?', ()=>
{
  expect(sum(99,99)).toBe(198)
});

//2
test('12 + 18 เท่ากับ ?' , ()=>
{
  expect(sum(12,18)).toBe(30)
});

//3
test('33 + 22 เท่ากับเท่าไร' ,()=>
{
  expect(sum(33,22)).toBe(55)
});